{
  "database-config": {
    "label": {
      "name": "Nom",
      "type": "Type",
      "apiKey": "Clé API",
      "url": "URL",
      "json": "Contenu JSON",
      "clientEmail": "Email Client",
      "privateKey": "Clé Privée",
      "email": "Email",
      "password": "MDP"
    },
    "divider": {
      "authMethod": "Méthode d'authentification",
      "credentials": "Identifiants",
      "tips": "Astuces"
    },
    "value": {
      "anonymous": "Anonyme",
      "email": "Email",
      "privateKey": "Clé Privée JSON"
    },
    "placeholder": {
      "apiKey": "Clé API de la base de données",
      "url": "URL de la base de données",
      "json": "Coller le contenu du fichier JSON",
      "clientEmail": "nom-compte-service@id-projet.iam.gserviceaccount.com",
      "privateKey": "-----BEGIN PRIVATE KEY-----<VOTRE_CLE>-----END PRIVATE KEY-----",
      "email": "votre@email.com",
      "password": "mot de passe"
    },
    "createNewUser": "Créer un nouvel utilisateur si celui-ci n'existe pas ?",
    "clickDragHere": "Cliquer ou faites glisser le fichier ici.",
    "dropFileHere": "Lacher le fichier ici",
    "tips": {
      "apiKey": "La <strong>Clé API</strong> se trouve dans les paramètres du projet.",
      "email": "Si vous avez déjà créé un utilisateur Firebase avec une adresse e-mail et un mot de passe, remplissez simplement vos identifiants.\nEn revanche, si vous n'en avez pas encore créé, vous pouvez le faire d'une des deux manières suivantes :",
      "emailMethod1": "Aller sur Firebase dans la section <strong>Authentifier</strong> et cliquez sur \"Ajouter un utilisateur\" puis saisissez vos identifiants dans le noeud de configuration.",
      "emailMethod2": "Entrer directement dans le noeud de configuration, une adresse e-mail et un mot de passe et cocher la case, le noeud créera un utilisateur pour vous. Cet utilisateur apparaîtra après connexion dans la section <strong>Authentifier</strong>.",
      "url": "L' <strong>URL</strong> peut être trouvée dans la console de la base de données, elle diffère selon l'emplacement géographique, la structure du lien est la suivante : <strong>https://&#x3C;project-id&#x3E;-default-rtdb.&#x3C;continent&#x3E;.firebaseddatabase.app/</strong> ou se termine par <strong>.firebaseio.com</strong> pour les États-Unis.",
      "json": "Pour générer un fichier JSON, rendez-vous dans la console Firebase, dans la section <strong>Paramètres du projet</strong>, cliquez sur <strong>Comptes de service</strong> puis sur <strong>Générer une nouvelle clé privée </strong>. Votre navigateur téléchargera un fichier JSON que vous pourrez soit déposer dans la zone grisée, soit ouvrir et coller dans les champs du noeud de configuration."
    }
  }
}